#способ вхождения количество элементов в список
#my_list_1 = [2, 2, 5, 12, 8, 2, 12]

#result = [] # результирующий список пока пустой

#for number in my_list_1:
    #if my_list_1.count(number) == 1:  #.count() - метод, который проверяет сколько раз
                                      # число входит в список. Ex: Если входит 1 раз...
        #result.append(number)         # добавляем в результирующий список

#print(result)


# Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов. (умножаем на -3)
# Пример:
# Для N = 5: 1, -3, 9, -27, 81

#n = int(input("Введите чиcло N: "))
#j = 1
#list1 = []
#for i in range(1, n + 1):
    #list1.append(str(j))
    #j *= -3
#
# print(", ".join(list1))

